In [1]:
import pandas as pd
import numpy as np

# 1. Explain the dataset

In [3]:
data=pd.read_csv("C:\\SourceFiles\\Advertising.csv")

In [4]:
data.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [5]:
data.columns

Index(['Unnamed: 0', 'TV', 'Radio', 'Newspaper', 'Sales'], dtype='object')

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  200 non-null    int64
 1   TV          200 non-null    float64
 2   Radio       200 non-null    float64
 3   Newspaper   200 non-null    float64
 4   Sales       200 non-null    float64
dtypes: float64(4), int64(1)
memory usage: 7.9 KB

In [7]:
len(data)

200

In [8]:
data.isna()

     Unnamed: 0     TV  Radio  Newspaper  Sales
0         False  False  False      False  False
1         False  False  False      False  False
2         False  False  False      False  False
3         False  False  False      False  False
4         False  False  False      False  False
..          ...    ...    ...        ...    ...
195       False  False  False      False  False
196       False  False  False      False  False
197       False  False  False      False  False
198       False  False  False      False  False
199       False  False  False      False  False

[200 rows x 5 columns]

In [9]:
data.isna().sum()

Unnamed: 0    0
TV            0
Radio         0
Newspaper     0
Sales         0
dtype: int64

In [ ]:
Explanation : There are a total of 200 samples and there is no null values. The data is about advertising done through different media and the sales achieved.

# 2. Check the summary statistics and discuss the max, min, avg, median, and percentiles.

In [11]:
 data=data.drop('Unnamed: 0',axis=1)

In [13]:
data.describe().T

           count      mean        std  min     25%     50%      75%    max
TV         200.0  147.0425  85.854236  0.7  74.375  149.75  218.825  296.4
Radio      200.0   23.2640  14.846809  0.0   9.975   22.90   36.525   49.6
Newspaper  200.0   30.5540  21.778621  0.3  12.750   25.75   45.100  114.0
Sales      200.0   14.0225   5.217457  1.6  10.375   12.90   17.400   27.0

In [15]:
np.min(data)

TV           0.7
Radio        0.0
Newspaper    0.3
Sales        1.6
dtype: float64

In [16]:
np.max(data)

TV           296.4
Radio         49.6
Newspaper    114.0
Sales         27.0
dtype: float64

In [17]:
np.mean(data)

TV           147.0425
Radio         23.2640
Newspaper     30.5540
Sales         14.0225
dtype: float64

In [19]:
data.median()

TV           149.75
Radio         22.90
Newspaper     25.75
Sales         12.90
dtype: float64

In [20]:
data.mode()

      TV  Radio  Newspaper  Sales
0   17.2    4.1        8.7    9.7
1   76.4    5.7        9.3    NaN
2  109.8    NaN       25.6    NaN
3  177.0    NaN        NaN    NaN
4  184.9    NaN        NaN    NaN
5  197.6    NaN        NaN    NaN
6  199.8    NaN        NaN    NaN
7  222.4    NaN        NaN    NaN
8  237.4    NaN        NaN    NaN
9  240.1    NaN        NaN    NaN

In [22]:
data.quantile([.25,.5,.75])

           TV   Radio  Newspaper   Sales
0.25   74.375   9.975      12.75  10.375
0.50  149.750  22.900      25.75  12.900
0.75  218.825  36.525      45.10  17.400

In [25]:
# The manager wants to find out whether the same amount was spent for the three advertisements (TV , Radio and Newspaper). Comment on your findings.

In [26]:
import scipy.stats as scp

H0: Amount Spent on three Advertisements are same
H1: Amount spent on three advertisements are different

In [28]:
f_value , p_value = scp.f_oneway(data['TV'], data['Radio'], data['Newspaper'])
print('The f value is:',f_value)
print('The p value is:',p_value)

The f value is: 358.8514595342597
The p value is: 4.552931539744962e-103

# As per the p-value  outcome we failed to Reject H0  that Amount spent on three advertisement are same and hence Amount spent is different for 3 advertisements